In [1]:
import pandas as pd
pd.read_csv("~/Desktop/jupyter-notebooks/alcohol.csv")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,NaN,NaN,NaN,NaN
1,Albania,89.0,132.0,54.0,4.9
2,Algeria,25.0,NaN,14.0,0.7
3,Andorra,245.0,138.0,312.0,12.4
4,Angola,217.0,57.0,45.0,5.9
...,...,...,...,...,...
188,Venezuela,333.0,1.0,3.0,7.7
189,Vietnam,111.0,2.0,1.0,2.0
190,Yemen,6.0,NaN,NaN,0.1
191,Zambia,32.0,19.0,4.0,2.5
192,Zimbabwe,64.0,18.0,4.0,4.7

In [2]:
#specifying the number of columns needed
pd.read_csv("alcohol.csv", usecols = ['country', 'wine_servings'])

         country  wine_servings
0    Afghanistan            NaN
1        Albania           54.0
2        Algeria           14.0
3        Andorra          312.0
4         Angola           45.0
..           ...            ...
188    Venezuela            3.0
189      Vietnam            1.0
190        Yemen            NaN
191       Zambia            4.0
192     Zimbabwe            4.0

[193 rows x 2 columns]

In [3]:
#we can sepecify which column do we want as index label by index_col=
alcohol = pd.read_csv("alcohol.csv", usecols =['country','wine_servings'], index_col='country')

In [4]:
alcohol.head()

             wine_servings
country
Afghanistan            NaN
Albania               54.0
Algeria               14.0
Andorra              312.0
Angola                45.0

In [5]:
type(alcohol)

pandas.core.frame.DataFrame

In [6]:
#squeeze parameter can convert csv table into panda series if csv is single column dataframe
alcohol = pd.read_csv("alcohol.csv",usecols=['country','wine_servings'],index_col='country',squeeze=True)

In [7]:
type(alcohol)

pandas.core.series.Series

#### Series sizing

In [8]:
alcohol.size

193

In [9]:
#gives values in form of an array
alcohol.values

array([ nan,  54.,  14., 312.,  45.,  45., 221.,  11., 212., 191.,   5.,
        51.,   7.,  nan,  36.,  42., 212.,   8.,  13.,  nan,   8.,   8.,
        35.,  16.,   1.,  94.,   7.,  nan,   7.,  16.,   1.,   4.,   1.,
         1.,   1., 172.,   8.,   3.,   1.,   9.,  74.,  11., 254.,   5.,
       113., 134.,  nan,   1., 278.,   3.,  26.,   9.,   3.,   1.,   2.,
       233.,  nan,  59.,  nan,   1.,  97.,  37.,  59.,   1., 149., 175.,
         1., 218.,  28.,   2.,   2.,  21.,   1.,   1.,   2., 185.,  78.,
        nan,  nan,  nan,  nan, 165.,   9., 237.,   9.,  16.,   1.,  12.,
         2.,   1.,  nan,   6., 123.,  62.,  31.,  nan,   2.,  nan,  56.,
       271.,   4.,   1.,  nan,  nan,   1.,  12.,  nan,  nan,  18.,   5.,
        18.,  nan,   8., 128.,   1.,   5.,  nan,   1.,   8.,  nan,  19.,
       175.,   1.,   1.,   2.,   7., 129.,   1.,  nan,  23.,  18.,   1.,
        74.,  21.,   1.,  56., 339.,   7.,   9.,  18., 167.,  73.,  nan,
        32.,  71.,  11.,  24.,  nan,  14.,  nan,   7., 127.,  51.,   2.,
        11., 116., 276.,   1.,  nan,  81., 112.,  nan,  nan,   7.,   2.,
       186.,  28.,  16.,  nan,   1.,  86.,   4.,  19.,   5.,   7.,   2.,
         7.,  32.,   9.,  nan,  45.,   5., 195.,   1.,  84.,  22.,   8.,
        11.,   3.,   1.,  nan,   4.,   4.])

In [10]:
#index is also available in Series data structure
alcohol.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [11]:
alcohol.values.size == alcohol.index.size

True

In [12]:
# .shape attribute gives a tupple of dimensions for series i.e. 1D
alcohol.shape

(193,)

### Unique Values and Series Monotonicity

In [13]:
# .is_unique is False for alcohol series becuase some country have same wine_servings
alcohol.is_unique

False

In [14]:
#checks the unqiue value of first five elements
alcohol.head().is_unique

True

In [15]:
#instead of getting boolean we can get no. of unqiue datas in series as
#remember the () bracket here as it is method while .is_unique is property
alcohol.nunique()

71

In [16]:
# .nunique() gives the number one less than the actual unique datas
# setting (dropna = False) 
alcohol.nunique(dropna = False )

72

 #### Monotonocity 
 :means the function keeps the given order

In [17]:
pd.Series([1,2,3]).is_monotonic

True

In [18]:
#though values are stagnant after sometime 
pd.Series([1,2,3,3,3,3,3]).is_monotonic

True

In [19]:
pd.Series([1,2,3,3,3,3,4,5,100]).is_monotonic

True

In [20]:
#but if the acending order is not followed than
pd.Series([1,2,3,3,3,3,4,5,100,99]).is_monotonic

False

In [21]:
pd.Series([1,2,3,3,3,3,4,78,100]).is_monotonic_increasing

True

In [22]:
#if we reverse our list than .is_monotonic_increasing gives False
pd.Series(reversed([1,2,3,3,3,3,4,78,100])).is_monotonic_increasing

False

### Count() method

In [23]:
alcohol.count()

162

In [24]:
alcohol.size

193

##### Why there is the difference in .size and .count() method?
 Because the count method returns number of non-null values of Series 
 i.e it excludes NaN values from our data

In [25]:
# .hasnans checks if the Series has NaN values
alcohol.hasnans

True

In [26]:
#gives boolean whether each index label has NaN values 
#returns True for the data that has null values
alcohol.isnull()

country
Afghanistan     True
Albania        False
Algeria        False
Andorra        False
Angola         False
               ...
Venezuela      False
Vietnam        False
Yemen           True
Zambia         False
Zimbabwe       False
Name: wine_servings, Length: 193, dtype: bool

In [27]:
#using indexing and and boolean mask of alcohol.isnull() we cn get series that have NaN values
alcohol.loc[alcohol.isnull()]

country
Afghanistan        NaN
Bangladesh         NaN
Bhutan             NaN
Burundi            NaN
North Korea        NaN
Eritrea            NaN
Ethiopia           NaN
India              NaN
Indonesia          NaN
Iran               NaN
Iraq               NaN
Kuwait             NaN
Lesotho            NaN
Libya              NaN
Malaysia           NaN
Maldives           NaN
Marshall Islands   NaN
Mauritania         NaN
Monaco             NaN
Myanmar            NaN
Nepal              NaN
Pakistan           NaN
Rwanda             NaN
San Marino         NaN
Saudi Arabia       NaN
Somalia            NaN
Sri Lanka          NaN
Sudan              NaN
Tajikistan         NaN
Uganda             NaN
Yemen              NaN
Name: wine_servings, dtype: float64

In [28]:
alcohol.loc[alcohol.isnull()].index

Index(['Afghanistan', 'Bangladesh', 'Bhutan', 'Burundi', 'North Korea',
       'Eritrea', 'Ethiopia', 'India', 'Indonesia', 'Iran', 'Iraq', 'Kuwait',
       'Lesotho', 'Libya', 'Malaysia', 'Maldives', 'Marshall Islands',
       'Mauritania', 'Monaco', 'Myanmar', 'Nepal', 'Pakistan', 'Rwanda',
       'San Marino', 'Saudi Arabia', 'Somalia', 'Sri Lanka', 'Sudan',
       'Tajikistan', 'Uganda', 'Yemen'],
      dtype='object', name='country')

In [29]:
type(alcohol.loc[alcohol.isnull()].index)

pandas.core.indexes.base.Index

In [30]:
#converting values thatcontaon null-values fromSeries into python list
list(alcohol.loc[alcohol.isnull()].index)

['Afghanistan',
 'Bangladesh',
 'Bhutan',
 'Burundi',
 'North Korea',
 'Eritrea',
 'Ethiopia',
 'India',
 'Indonesia',
 'Iran',
 'Iraq',
 'Kuwait',
 'Lesotho',
 'Libya',
 'Malaysia',
 'Maldives',
 'Marshall Islands',
 'Mauritania',
 'Monaco',
 'Myanmar',
 'Nepal',
 'Pakistan',
 'Rwanda',
 'San Marino',
 'Saudi Arabia',
 'Somalia',
 'Sri Lanka',
 'Sudan',
 'Tajikistan',
 'Uganda',
 'Yemen']

In [31]:
#to count the null in Series we can use
# len(list(alcohol.loc[alcohol.isnull()].index))
#more pandorable way is
alcohol.isnull().sum()
#we  sum the boolean of .isnull() which is equivalent to sum of 1's and 0's

31

In [32]:
all = alcohol.size
non_nulls =alcohol.count()
nulls = alcohol.isnull().sum()
# can also be used .isna().sum()

In [33]:
all == non_nulls + nulls

True